app/controllers/pokemon_controller.rb

  def create
    @pokemon = Pokemon.new(pokemon_params)

    if @pokemon.save
---
INSERT INTO "pokemons" ("image_url", "attack", "defense", "name", "poke_type", "moves", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def index
    @pokemon = Pokemon.order(:id)
---
SELECT "pokemons".* FROM "pokemons"  ORDER BY "pokemons"."id" ASC

  def update
    @pokemon = Pokemon.find(params[:id])
    @pokemon.update(pokemon_params)
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "pokemons" SET "name" = $1, "updated_at" = $2 WHERE "pokemons"."id" = $3  [["name", "Krabb"], ["updated_at", "2015-08-04 00:13:08.732564"], ["id", 1]]